/*
 * @(#)redirect.js 1.0 2015/06/15
 * 
 * COPYRIGHT (C) 2013 WISEITECH CO., LTD. ALL RIGHTS RESERVED.
 */

/**
 * 리다이렉트를 처리하는 스크립트이다.
 *
 * @author 김은삼
 * @version 1.0 2015/06/15
 */
$(function() {
    // 컴포넌트를 초기화한다.
    initComp();
    
    // 마스크를 바인딩한다.
    bindMask();
    
    // 이벤트를 바인딩한다.
    bindEvent();
    
    // 옵션을 로드한다.
    loadOptions();
    
    // 데이터를 로드한다.
    loadData();
});

////////////////////////////////////////////////////////////////////////////////
// 글로벌 변수
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 초기화 함수
////////////////////////////////////////////////////////////////////////////////
/**
 * 컴포넌트를 초기화한다.
 */
function initComp() {
    // Nothing to do.
}

/**
 * 마스크를 바인딩한다.
 */
function bindMask() {
    // Nothing to do.
}

/**
 * 이벤트를 바인딩한다.
 */
function bindEvent() {
    // Nothing to do.
}

/**
 * 옵션을 로드한다.
 */
function loadOptions() {
    // Nothing do do.
}

/**
 * 데이터를 로드한다.
 */
function loadData() {
    if (reload) {
        // 화면을 리로드한다.
        reloadPage();
    }
}

////////////////////////////////////////////////////////////////////////////////
// 서비스 함수
////////////////////////////////////////////////////////////////////////////////
/**
 * 화면을 리로드한다.
 */
function reloadPage() {
    try {
        if (session) {
            if (window.opener) {
                window.opener.focus();
                
                var form = $(window.opener["global-request-form"]);
                
                if (form.length > 0) {
                    if (session.agreeYn != "Y") {
                        form.append("<input type=\"hidden\" name=\"ACTION\" />");
                        
                        form.find("[name=ACTION]").val(form.attr("action"));
                        
                        form.attr("action", "/portal/user/oauth/registerPage.do");
                    }
                    
                    form.submit();
                }
            }
        }
    }
    catch (e) {
    	console.error("Exception] reloadPage Error!");
    }
    finally {
        window.close();
    }
}


////////////////////////////////////////////////////////////////////////////////
// 전처리 함수
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 후처리 함수
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 이벤트 함수
////////////////////////////////////////////////////////////////////////////////