/*
 * @(#)selectEvent.js 1.0 2015/06/15
 * 
 * COPYRIGHT (C) 2013 WISEITECH CO., LTD. ALL RIGHTS RESERVED.
 */

/**
 * 이벤트 게시판 내용을 조회하는 스크립트이다.
 *
 * @author 김은삼
 * @version 1.0 2015/06/15
 */
$(function() {
    // 컴포넌트를 초기화한다.
    initComp();
    
    // 마스크를 바인딩한다.
    bindMask();
    
    // 이벤트를 바인딩한다.
    bindEvent();
    
    // 옵션을 로드한다.
    loadOptions();
    
    // 데이터를 로드한다.
    loadData();
});

////////////////////////////////////////////////////////////////////////////////
// 글로벌 변수
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 초기화 함수
////////////////////////////////////////////////////////////////////////////////
/**
 * 컴포넌트를 초기화한다.
 */
function initComp() {
    // Nothing to do.
}

/**
 * 마스크를 바인딩한다.
 */
function bindMask() {
    // Nothing to do.
}

/**
 * 이벤트를 바인딩한다.
 */
function bindEvent() {
    // 이벤트 응모하기 버튼에 클릭 이벤트를 바인딩한다.
    $(".event-insert-button").bind("click", function(event) {
        // 이벤트 게시판 내용을 등록한다.
        insertEvent(this);
        return false;
    });
    
    // 이벤트 응모하기 버튼에 키다운 이벤트를 바인딩한다.
    $(".event-insert-button").bind("keydown", function(event) {
        if (event.which == 13) {
            // 이벤트 게시판 내용을 등록한다.
            insertEvent(this);
            return false;
        }
    });
}

/**
 * 옵션을 로드한다.
 */
function loadOptions() {
    // Nothing do do.
}

/**
 * 데이터를 로드한다.
 */
function loadData() {
    // Nothing to do.
}

////////////////////////////////////////////////////////////////////////////////
// 서비스 함수
////////////////////////////////////////////////////////////////////////////////
/**
 * 이벤트 게시판 내용을 등록한다.
 * 
 * @param button {Element} 버튼
 */
function insertEvent(button) {
    if ($(button).hasClass("opened")) {
        window.location.href = com.wise.help.url("/portal/etc/event/insertBulletinPage.do");
    }
    else {
        alert("이벤트 기간이 아닙니다.");
    }
}

////////////////////////////////////////////////////////////////////////////////
// 전처리 함수
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 후처리 함수
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// 이벤트 함수
////////////////////////////////////////////////////////////////////////////////